# gty reference clock
create_clock  -name gt_refclk1_in -period 6.4 [get_ports GTYQ0_P]
set_clock_groups -asynchronous -group [get_clocks gt_refclk1_in -include_generated_clocks]
set_false_path -to [get_pins -hier *aurora_64b66b_0_cdc_to*/D]
set_property LOC AN40 [get_ports GTYQ0_P]
set_property LOC AN41 [get_ports GTYQ0_N]
# gty initial clock
create_clock -period 10.000	 [get_ports INIT_CLK]
set_clock_groups -asynchronous -group [get_clocks INIT_CLK -include_generated_clocks]
set_property PACKAGE_PIN G18     [get_ports INIT_CLK]
set_property IOSTANDARD LVCMOS18 [get_ports INIT_CLK]
# gty lane pin
set_property PACKAGE_PIN AU49 [get_ports {TXN[0]}]
set_property PACKAGE_PIN AU48 [get_ports {TXP[0]}]
set_property PACKAGE_PIN AU54 [get_ports {RXN[0]}]
set_property PACKAGE_PIN AU53 [get_ports {RXP[0]}]
set_property PACKAGE_PIN AT47 [get_ports {TXN[1]}]
set_property PACKAGE_PIN AT46 [get_ports {TXP[1]}]
set_property PACKAGE_PIN AT52 [get_ports {RXN[1]}]
set_property PACKAGE_PIN AT51 [get_ports {RXP[1]}]
set_property PACKAGE_PIN AR49 [get_ports {TXN[2]}]
set_property PACKAGE_PIN AR48 [get_ports {TXP[2]}]
set_property PACKAGE_PIN AR54 [get_ports {RXN[2]}]
set_property PACKAGE_PIN AR53 [get_ports {RXP[2]}]
set_property PACKAGE_PIN AR45 [get_ports {TXN[3]}]
set_property PACKAGE_PIN AR44 [get_ports {TXP[3]}]
set_property PACKAGE_PIN AP52 [get_ports {RXN[3]}]
set_property PACKAGE_PIN AP51 [get_ports {RXP[3]}]